# print(52)
# print("Hello, Maxim!!!")
# print('Hello, Maxim')
# print('Отель называется "Элеон"')
# print(
#     """
#     Мой дядя самых честных правил,
#     Когда не в шутку занемог
#     """
# )
# # print('Мой дядя самых честных правил,
# #     Когда не в шутку занемог')
#
# print(f'В нашей работе {456 + 486} страниц')

# for i in range(-1000, 2000, 1):
#     i = i / 1000
#     print(f'В нашей работе {i**i} страниц, номер итерации {i}')
from pprint import pprint

pprint(
    "Мой дядя самых честных правил, Когда не в шутку занемог"
)
